# Представлен список чисел. Определить элементы списка, не имеющие повторений.
# Сформировать итоговый массив чисел, соответствующих требованию.
# Элементы вывести в порядке их следования в исходном списке.
# Для выполнения задания обязательно использовать генератор.
# Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
# Результат: [23, 1, 3, 10, 4, 11]

from random import randint

initial_list = [randint(-100, 100) for i in range(10)]

print(f'{initial_list} - Исходный список.')
print(f'{[el for el in initial_list if initial_list.count(el) == 1]} - Числа, не имеющие повторений.')
